#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/uux0vy-dev/runs/run-ss1jsz3waJdVwmR8

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Initializing plugins and modules...
tls_private_key.private_key: Refreshing state... [id=93189a6e1018f93458f245bce5913f7380af26c8]
aws_cloudfront_function.request: Refreshing state... [id=ien-dev-cf-request]
aws_cloudfront_function.response: Refreshing state... [id=ien-dev-cf-response]
aws_iam_role.lambda: Refreshing state... [id=ien-dev-lambda]
aws_sqs_queue.terraform_queue: Refreshing state... [id=https://sqs.ca-central-1.amazonaws.com/588188670678/slack-notification-queue]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ien-dev-ec2-role]
aws_cloudwatch_event_rule.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters]
aws_key_pair.key_pair: Refreshing state... [id=ien-dev-key]
aws_ssm_parameter.public_key_ssm_param: Refreshing state... [id=/ien-dev/public-key]
aws_ssm_parameter.private_key_ssm_param: Refreshing state... [id=/ien-dev/private-key]
aws_cloudwatch_event_rule.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants]
aws_apigatewayv2_api.api: Refreshing state... [id=h42aam618b]
aws_cloudfront_origin_access_identity.app: Refreshing state... [id=E2IVILJXHTCWXZ]
aws_cloudwatch_log_group.api_gateway: Refreshing state... [id=api-gw/ien-dev-api/logs]
aws_ssm_parameter.public_key_openssh_ssm_param: Refreshing state... [id=/ien-dev/public-key-openssh]
aws_s3_bucket.app: Refreshing state... [id=ien-dev-app]
aws_iam_role_policy_attachment.lambda_cloudwatch: Refreshing state... [id=ien-dev-lambda-20220401150128722800000004]
aws_iam_role_policy_attachment.lambda_s3: Refreshing state... [id=ien-dev-lambda-20220401150128719700000003]
aws_iam_role_policy_attachment.lambda_execute: Refreshing state... [id=ien-dev-lambda-20220401150128751600000005]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=ien-dev-lambda-20220401150128716700000001]
aws_iam_role_policy_attachment.lambda_sqs: Refreshing state... [id=ien-dev-lambda-20220401150128718800000002]
aws_apigatewayv2_stage.api: Refreshing state... [id=$default]
aws_db_subnet_group.pgsql: Refreshing state... [id=pgsql]
aws_lambda_function.SQSLambda: Refreshing state... [id=ien-dev-notifylambda]
aws_instance.bastion_instance: Refreshing state... [id=i-09ad5e8155adc8fbf]
aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=33be0a52-9522-4ea3-bcfc-8ec1f73a9000]
aws_rds_cluster.pgsql: Refreshing state... [id=ien-dev-db]
aws_s3_bucket_policy.app: Refreshing state... [id=ien-dev-app]
aws_cloudfront_distribution.app: Refreshing state... [id=EM85EBT6QA4PS]
aws_rds_cluster_instance.pgsql[0]: Refreshing state... [id=ien-dev-db-0]
aws_lambda_function.SyncApplicants: Refreshing state... [id=ien-dev-syncdata]
aws_lambda_function.api: Refreshing state... [id=ien-dev-api]
aws_lambda_permission.api_allow_gateway: Refreshing state... [id=terraform-20220401150623852600000001]
aws_apigatewayv2_integration.api: Refreshing state... [id=d0ksdj8]
aws_lambda_permission.hmbc_to_ien_applicants: Refreshing state... [id=AllowExecutionFromCloudWatch_EarlyMorning]
aws_lambda_permission.hmbc_to_ien_masters: Refreshing state... [id=AllowExecutionFromCloudWatch_Morning]
aws_cloudwatch_event_target.hmbc_to_ien_masters: Refreshing state... [id=ien-dev-hmbc-to-ien-masters-terraform-20220421203905121600000002]
aws_cloudwatch_event_target.hmbc_to_ien_applicants: Refreshing state... [id=ien-dev-hmbc-to-ien-applicants-terraform-20220421203905110400000001]
aws_apigatewayv2_route.api: Refreshing state... [id=jkgaazn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_lambda_function.SQSLambda has changed
  ~ resource "aws_lambda_function" "SQSLambda" {
        id                             = "ien-dev-notifylambda"
      ~ last_modified                  = "2022-09-15T21:04:59.000+0000" -> "2022-09-16T12:52:44.000+0000"
      ~ source_code_hash               = "/DodpweLll/9g8Ngu/mQvDzDCXl7MUNP2AV+NaCYFrc=" -> "G7rG6pORIZ+t0v4hrL69RA9yB44UCBop/TGAAeQ/+48="
      ~ source_code_size               = 49114320 -> 49123915
        tags                           = {}
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TEAMS_ALERTS_WEBHOOK_URL" = "https://eygs.webhook.office.com/webhookb2/da68af8d-f137-4393-a4b1-74f3072d477c@5b973f99-77df-4beb-b27d-aa0c70b8482c/IncomingWebhook/2a8d3d7edb0b41368223ef5d1cfa4ea9/fbe9c53a-c150-4efd-938d-0ca7adb265ff"
                # (8 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.SyncApplicants has changed
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
      ~ last_modified                  = "2022-09-15T21:04:59.000+0000" -> "2022-09-15T21:07:57.000+0000"
      ~ source_code_hash               = "/DodpweLll/9g8Ngu/mQvDzDCXl7MUNP2AV+NaCYFrc=" -> "G7rG6pORIZ+t0v4hrL69RA9yB44UCBop/TGAAeQ/+48="
      ~ source_code_size               = 49114320 -> 49123915
        tags                           = {}
        # (22 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.api has changed
  ~ resource "aws_lambda_function" "api" {
        id                             = "ien-dev-api"
      ~ last_modified                  = "2022-09-15T21:05:00.000+0000" -> "2022-09-15T21:20:03.000+0000"
      ~ source_code_hash               = "/DodpweLll/9g8Ngu/mQvDzDCXl7MUNP2AV+NaCYFrc=" -> "G7rG6pORIZ+t0v4hrL69RA9yB44UCBop/TGAAeQ/+48="
      ~ source_code_size               = 49114320 -> 49123915
        tags                           = {}
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "HMBC_ATS_BASE_URL" = (sensitive)
                # (15 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.event_source_mapping must be replaced
-/+ resource "aws_lambda_event_source_mapping" "event_source_mapping" {
      - bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:ca-central-1:588188670678:slack-notification-queue" -> (known after apply) # forces replacement
      ~ function_arn                       = "arn:aws:lambda:ca-central-1:588188670678:function:ien-dev-notifylambda" -> (known after apply)
      - function_response_types            = [] -> null
      ~ id                                 = "33be0a52-9522-4ea3-bcfc-8ec1f73a9000" -> (known after apply)
      ~ last_modified                      = "2022-06-14T00:23:42Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      - maximum_batching_window_in_seconds = 0 -> null
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      - queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "33be0a52-9522-4ea3-bcfc-8ec1f73a9000" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_function.SQSLambda will be updated in-place
  ~ resource "aws_lambda_function" "SQSLambda" {
      - code_signing_config_arn        = "" -> null
        id                             = "ien-dev-notifylambda"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AWS_S3_REGION"            = "ca-central-1"
              - "BUILD_ID"                 = "39c358a"
              - "BUILD_INFO"               = "39c358a, GitHub, Removed-redundant-column-373, grafted, HEAD, tag: refs/tags/dev"
              - "NODE_ENV"                 = "production"
              - "RUNTIME_ENV"              = "hosted"
              - "SLACK_ALERTS_WEBHOOK_URL" = (sensitive)
              - "SQS_QUEUE_URL"            = "https://sqs.ca-central-1.amazonaws.com/588188670678/slack-notification-queue"
              - "TARGET_ENV"               = "dev"
              - "TEAMS_ALERTS_WEBHOOK_URL" = "https://eygs.webhook.office.com/webhookb2/da68af8d-f137-4393-a4b1-74f3072d477c@5b973f99-77df-4beb-b27d-aa0c70b8482c/IncomingWebhook/2a8d3d7edb0b41368223ef5d1cfa4ea9/fbe9c53a-c150-4efd-938d-0ca7adb265ff"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.SyncApplicants will be updated in-place
  ~ resource "aws_lambda_function" "SyncApplicants" {
        id                             = "ien-dev-syncdata"
        tags                           = {}
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "BUILD_ID"          = "39c358a" -> "3aa1634"
              ~ "BUILD_INFO"        = "39c358a, GitHub, Removed-redundant-column-373, grafted, HEAD, tag: refs/tags/dev" -> "3aa1634, GitHub, Merge-1d8930f099eb2d0f23d4a159ee1ebd009c5c9098-into-bc671e1f346008e2c8dd1f5eb2be47a6384acf0c, grafted, HEAD, refs/remotes/pull/376/merge"
                # (13 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
      - code_signing_config_arn        = "" -> null
        id                             = "ien-dev-api"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AUTH_REALM"        = (sensitive)
              - "AUTH_URL"          = (sensitive)
              - "AWS_S3_REGION"     = "ca-central-1"
              - "BUILD_ID"          = "39c358a"
              - "BUILD_INFO"        = "39c358a, GitHub, Removed-redundant-column-373, grafted, HEAD, tag: refs/tags/dev"
              - "HMBC_ATS_AUTH_KEY" = (sensitive)
              - "HMBC_ATS_BASE_URL" = (sensitive)
              - "JWT_SECRET"        = (sensitive)
              - "NODE_ENV"          = "production"
              - "POSTGRES_DATABASE" = "ien"
              - "POSTGRES_HOST"     = "ien-dev-db.cluster-ct57eoah4xou.ca-central-1.rds.amazonaws.com"
              - "POSTGRES_PASSWORD" = (sensitive)
              - "POSTGRES_USERNAME" = "freshworks"
              - "RUNTIME_ENV"       = "hosted"
              - "SQS_QUEUE_URL"     = "https://sqs.ca-central-1.amazonaws.com/588188670678/slack-notification-queue"
              - "TARGET_ENV"        = "dev"
            } -> (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_sqs_queue.terraform_queue must be replaced
-/+ resource "aws_sqs_queue" "terraform_queue" {
      ~ arn                               = "arn:aws:sqs:ca-central-1:588188670678:slack-notification-queue" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.ca-central-1.amazonaws.com/588188670678/slack-notification-queue" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "slack-notification-queue" -> "teams-notification-queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      - tags                              = {} -> null
      ~ tags_all                          = {} -> (known after apply)
      ~ url                               = "https://sqs.ca-central-1.amazonaws.com/588188670678/slack-notification-queue" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.


------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 2 of 9 estimated
           $226.3600000000000008/mo +$0.0

```

</details>